In [1]:
import pandas as pd
import numpy as np

In [2]:
#df = pd.read_csv('D:\\Datasets\\tips.csv')
df = pd.read_csv("D:/Datasets/tips.csv")
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
total_bill    244 non-null float64
tip           244 non-null float64
sex           244 non-null object
smoker        244 non-null object
day           244 non-null object
time          244 non-null object
size          244 non-null int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

# SELECT

    SELECT total_bill, tip, smoker, time
    FROM tips
    LIMIT 5;

In [4]:
df[['total_bill', 'tip', 'smoker', 'time']].head(5)

   total_bill   tip smoker    time
0       16.99  1.01     No  Dinner
1       10.34  1.66     No  Dinner
2       21.01  3.50     No  Dinner
3       23.68  3.31     No  Dinner
4       24.59  3.61     No  Dinner

# WHERE

    SELECT * FROM tips
    WHERE time = 'Dinner'
    LIMIT 5;

In [5]:
df[ df.time == 'Dinner' ].head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

### Yukarıdaki sorguda True olan satırlar filtrelenir
    df.time == 'Dinner'
    0       True
    1       True
    2       True
    3       True
    4       True
    5       True

    SELECT *
    FROM tips
    WHERE time = 'Dinner' AND tip > 5.00;

In [7]:
df[ (df.time == 'Dinner') & (df.tip > 5.0) ].head(5)

    total_bill   tip     sex smoker  day    time  size
23       39.42  7.58    Male     No  Sat  Dinner     4
44       30.40  5.60    Male     No  Sun  Dinner     4
47       32.40  6.00    Male     No  Sun  Dinner     4
52       34.81  5.20  Female     No  Sun  Dinner     4
59       48.27  6.73    Male     No  Sat  Dinner     4

# GROUP BY

    SELECT day, avg(total_bill) as total_bill, avg(tip) as tip
    FROM tips
    GROUP BY day;

In [8]:
# Yöntem-1
df.groupby(['day'])['total_bill','tip'].mean().reset_index()

    day  total_bill       tip
0   Fri   17.151579  2.734737
1   Sat   20.441379  2.993103
2   Sun   21.410000  3.255132
3  Thur   17.682742  2.771452

In [9]:
# Yöntem-2
df.groupby(['day'])['total_bill','tip'].agg(['mean']).reset_index()

    day total_bill       tip
              mean      mean
0   Fri  17.151579  2.734737
1   Sat  20.441379  2.993103
2   Sun  21.410000  3.255132
3  Thur  17.682742  2.771452

    SELECT day, AVG(tip), COUNT(*)
    FROM tips
    GROUP BY day;

In [10]:
df.groupby('day').agg({'tip': np.mean, 'day': np.size})

           tip  day
day
Fri   2.734737   19
Sat   2.993103   87
Sun   3.255132   76
Thur  2.771452   62

    SELECT smoker, day, COUNT(*), AVG(tip)
    FROM tips
    GROUP BY smoker, day;

In [11]:
df.groupby(['smoker', 'day']).agg({'tip': [np.size, np.mean]}) \
.sort_values('day')

              tip
             size      mean
smoker day
No     Fri    4.0  2.812500
Yes    Fri   15.0  2.714000
No     Sat   45.0  3.102889
Yes    Sat   42.0  2.875476
No     Sun   57.0  3.167895
Yes    Sun   19.0  3.516842
No     Thur  45.0  2.673778
Yes    Thur  17.0  3.030000

# UPDATE

    UPDATE tips
    SET tip = tip*1000
    WHERE tip < 2;

In [9]:
df.loc[df['tip'] < 2, 'tip'] *= 1000

In [10]:
df.head(10)

   total_bill      tip     sex smoker  day    time  size
0       16.99  1010.00  Female     No  Sun  Dinner     2
1       10.34  1660.00    Male     No  Sun  Dinner     3
2       21.01     3.50    Male     No  Sun  Dinner     3
3       23.68     3.31    Male     No  Sun  Dinner     2
4       24.59     3.61  Female     No  Sun  Dinner     4
5       25.29     4.71    Male     No  Sun  Dinner     4
6        8.77     2.00    Male     No  Sun  Dinner     2
7       26.88     3.12    Male     No  Sun  Dinner     4
8       15.04  1960.00    Male     No  Sun  Dinner     2
9       14.78     3.23    Male     No  Sun  Dinner     2

# DELETE

    DELETE FROM tips
    WHERE tip > 1000;

In [11]:
df = df.loc[df['tip'] > 1000]

In [12]:
len(df)

41

In [1]:
# Kaynak: https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html